kafka_benchmark_results_20250924_211445/baseline/producer-test.log
4999 records sent, 999.8 records/sec (0.98 MB/sec), 2.5 ms avg latency, 342.0 ms max latency.
5002 records sent, 1000.2 records/sec (0.98 MB/sec), 1.1 ms avg latency, 4.0 ms max latency.
12000 records sent, 999.250562 records/sec (0.98 MB/sec), 1.74 ms avg latency, 342.00 ms max latency, 1 ms 50th, 2 ms 95th, 18 ms 99th, 28 ms 99.9th.